---
kind: other
id: Properties.T:Autodesk.Revit.DB.RenderNode
source: html/36ef9549-8d37-dd59-41f8-27adc83f0c1e.htm
---
# RenderNode Properties

Specifies whether the .NET object represents a valid Revit entity.